In [1]:
!pip install pymysql;

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 1.3 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///zinduaschool.db

In [4]:
%%sql
CREATE TABLE personal_details (
national_ID INTEGER(15) , stud_ID VARCHAR(15),stud_name VARCHAR(100),
phone_number VARCHAR(15),age INTEGER, gender VARCHAR(10),
PRIMARY KEY(national_ID) );

 * sqlite:///zinduaschool.db
Done.

[]

In [5]:
%%sql
INSERT INTO personal_details (national_ID,stud_ID,stud_name,phone_number,age,gender)
VALUES("344534","stud101","Hermione Granger" ,"0712345678",20,"Male"),
("379683","stud102","Draco Malfo" ,"0723456781",21,"Female"),
("347403","stud103","Jayden Wamashati" ,"0734567812",22,"Male"),
("377302","stud104","Ron Weasley" ,"0745678123",19,"Female"),
("336741","stud105","Dolores Umbridge" ,"0756781234",21,"Male"),
("307243","stud106","Hedwig Tonks" ,"0767812345",21,"Female"),
("310932","stud107","Chao Chang" ,"0778123456",22,"Male"),
("343920","stud108","Curfew Yaeitpm" ,"0781234567",20,"Female"),
("345261","stud109","Chaptr Mukenya" ,"0722345678",20,"Male");

 * sqlite:///zinduaschool.db
9 rows affected.

[]

In [6]:
%%sql
CREATE TABLE school_details(stud_ID VARCHAR(15), current_home_county VARCHAR(20),
secondary_school_county VARCHAR(20), residence VARCHAR(15), stud_email VARCHAR(50),
PRIMARY KEY (stud_ID)  );

 * sqlite:///zinduaschool.db
Done.

[]

In [8]:
%%sql
INSERT INTO school_details(stud_ID)
SELECT stud_ID
FROM personal_details;

 * sqlite:///zinduaschool.db
9 rows affected.

[]

In [12]:
%%sql
UPDATE school_details
SET stud_email = (SELECT REPLACE (stud_name,' ','') || '@zinduaschool.ac'
					FROM personal_details
					WHERE school_details.stud_ID = personal_details.stud_ID) ;

 * sqlite:///zinduaschool.db
9 rows affected.

[]

In [13]:
%%sql
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud101";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud102";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud103";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud104";
UPDATE school_details SET current_home_county="Nyamira", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud105";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud106";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud107";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Mombasa", residence="Out of school" WHERE stud_ID="stud108";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud109";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud110";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Turkana", residence="In school" WHERE stud_ID="stud111";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud112";

 * sqlite:///zinduaschool.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [14]:
%%sql
CREATE TABLE contact_details (stud_email VARCHAR(50) , phone_number VARCHAR(15), next_of_kin_name VARCHAR(50),next_of_kin_relation VARCHAR(10), next_of_kin_contacts VARCHAR(13) );

 * sqlite:///zinduaschool.db
Done.

[]

In [15]:
%%sql
INSERT INTO contact_details(phone_number, next_of_kin_name,next_of_kin_relation,next_of_kin_contacts)
VALUES("0712345678","Darius Young","Father","0782382383"),
("0723456781","Lucy Nderitu","Mother","0723238983"),
("0734567812","Jerotich Koech","Mother","0779343126"),
("0745678123","Mwaura Mwangi","Father","0798246347"),
("0756781234","Ian Patrick","Father","0711234453"),
("0767812345","Lebron James","Father","0765439233"),
("0778123456","Magna Carter","Father","0702526243");

 * sqlite:///zinduaschool.db
7 rows affected.

[]

In [16]:
%%sql
UPDATE contact_details
SET stud_email = (SELECT school_details.stud_email
FROM school_details, personal_details
WHERE school_details.stud_ID = personal_details.stud_ID
AND personal_details.phone_number = contact_details.phone_number);

 * sqlite:///zinduaschool.db
7 rows affected.

[]

In [20]:
%%sql
CREATE TABLE financial_details (stud_ID VARCHAR(15) ,stud_name VARCHAR(50) ,
sem_fee INTEGER(6) , fee_paid INTEGER(6),
PRIMARY KEY(stud_ID) );

 * sqlite:///zinduaschool.db
Done.

[]

In [21]:
%%sql
INSERT INTO financial_details(stud_ID,stud_name)
SELECT personal_details.stud_ID, personal_details.stud_name
FROM personal_details;

 * sqlite:///zinduaschool.db
9 rows affected.

[]

In [22]:
%%sql
UPDATE financial_details SET sem_fee = 25000, fee_paid=25000 WHERE stud_ID = "stud101";
UPDATE financial_details SET sem_fee= 25000, fee_paid=19000 WHERE stud_ID = "stud102";
UPDATE financial_details SET sem_fee= 21900, fee_paid=20000 WHERE stud_ID = "stud103";
UPDATE financial_details SET sem_fee= 22000, fee_paid=22000 WHERE stud_ID = "stud104";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23400 WHERE stud_ID = "stud105";
UPDATE financial_details SET sem_fee= 25000, fee_paid=27000 WHERE stud_ID = "stud106";
UPDATE financial_details SET sem_fee= 24230, fee_paid=21200 WHERE stud_ID = "stud107";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23500 WHERE stud_ID = "stud108";
UPDATE financial_details SET sem_fee= 25000, fee_paid=24500 WHERE stud_ID = "stud109";
UPDATE financial_details SET sem_fee= 25000, fee_paid=25000 WHERE stud_ID = "stud110";
UPDATE financial_details SET sem_fee= 26000, fee_paid=26000 WHERE stud_ID = "stud111";
UPDATE financial_details SET sem_fee= 25000, fee_paid=20900 WHERE stud_ID = "stud112";

 * sqlite:///zinduaschool.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [31]:
%%sql
CREATE VIEW full_stud_details AS
SELECT pd.*, sd.current_home_county, sd.secondary_school_county, sd.residence, cd.phone_number, cd.next_of_kin_name, cd.next_of_kin_relation, cd.next_of_kin_contacts, fd.sem_fee, fd.fee_paid
FROM personal_details pd
JOIN school_details sd ON pd.stud_ID = sd.stud_ID
JOIN contact_details cd ON pd.stud_email = cd.stud_email
JOIN financial_details fd ON pd.stud_ID = fd.stud_ID;

 * sqlite:///zinduaschool.db
Done.

[]

In [32]:
%%sql
UPDATE financial_details
SET stud_name = (SELECT stud_name FROM personal_details WHERE personal_details.stud_ID = financial_details.stud_ID)
WHERE stud_name IS NULL;

 * sqlite:///zinduaschool.db
0 rows affected.

[]

In [33]:
%%sql
CREATE VIEW financial_details_view AS
SELECT *, fee_paid >= sem_fee AS fee_cleared
FROM financial_details;

 * sqlite:///zinduaschool.db
Done.

[]

In [34]:
%%sql
CREATE VIEW fee_cleared AS
SELECT pd.national_ID, fd.stud_name
FROM financial_details fd
JOIN personal_details pd ON fd.stud_ID = pd.stud_ID
WHERE fd.fee_paid >= fd.sem_fee;

 * sqlite:///zinduaschool.db
Done.

[]

In [35]:
%%sql
CREATE VIEW total_fee_balance AS
SELECT SUM(fee_paid) AS total_fees_paid, SUM(sem_fee - fee_paid) AS total_current_deficit
FROM financial_details;

 * sqlite:///zinduaschool.db
Done.

[]

In [36]:
%%sql
CREATE VIEW home_county_count AS
SELECT current_home_county, COUNT(*) AS student_count
FROM school_details
GROUP BY current_home_county;

 * sqlite:///zinduaschool.db
Done.

[]

In [37]:
%%sql
CREATE VIEW secondary_school_count AS
SELECT secondary_school_county,
       SUM(CASE WHEN gender = 'Male' THEN 1 ELSE 0 END) AS male_count,
       SUM(CASE WHEN gender = 'Female' THEN 1 ELSE 0 END) AS female_count
FROM school_details
GROUP BY secondary_school_county;

 * sqlite:///zinduaschool.db
Done.

[]

In [38]:
%%sql
CREATE VIEW kin_percentage AS
SELECT next_of_kin_relation,
       (COUNT(*) / (SELECT COUNT(*) FROM contact_details)) * 100 AS percentage
FROM contact_details
GROUP BY next_of_kin_relation;

 * sqlite:///zinduaschool.db
Done.

[]